app/views/static_pages/home.html.erb

        <div class="slick-slider">
          <%- Car.where(status: 'Available', style: 'Coupe').limit(5).each.with_index(1) do |car| %>
---
SELECT  "cars".* FROM "cars" WHERE "cars"."status" = ? AND "cars"."style" = ? ORDER BY "cars"."id" DESC LIMIT ?  [["status", "Available"], ["style", "Coupe"], ["LIMIT", 5]]