app/views/reservations/_form.html.erb

      <%= form.label "Car plate number: " %>
      <%= Car.find(car_id).licensePlateNumber %>
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    <%= form.label "User id and name: " %>
    <%= form.collection_select :user_id, User.where.not(role: "SuperAdmin"), :id, lambda {|u| "#{u.id}- #{u.name}"}, {:prompt => "Please select user id"} %>
---
SELECT "users".* FROM "users" WHERE ("users"."role" != ?)  [["role", "SuperAdmin"]]