app/views/reservations/index.html.erb

SELECT "users".* FROM "users"
---
              <% if isSuperAdmin? %>
              <%= f.collection_select :user_id_eq, User.all, :id, lambda {|u| "#{u.id} - #{u.name}"}, {:prompt => "Please select user id"} %><br>

SELECT "cars".* FROM "cars"
---
              <%= f.label "Car licensePlateNumber: " %>
              <%= f.collection_select :car_id_eq, Car.all, :id, lambda {|c| "#{c.licensePlateNumber}"}, {:prompt => "Please select a car"}, {:class => "form-control"} %>