app/views/reservations/show.html.erb

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Car Plate Number:</strong>
  <%=  Car.find(@reservation.car_id).licensePlateNumber %>