app/views/waitinglists/index.html.erb


        <td><%= link_to Car.find_by_id(waitinglist.car_id).licensePlateNumber, Car.find_by_id(waitinglist.car_id) %></td>
        <td><%= link_to User.find_by_id(waitinglist.user_id).name, User.find_by_id(waitinglist.user_id) %></td>
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]