app/controllers/cars_controller.rb

SELECT  "cars".* FROM "cars" WHERE ("cars"."status" != ?) AND ("cars"."status" LIKE '%Available%') LIMIT ? OFFSET ?  [["status", "Suggested"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "cars" WHERE ("cars"."status" != ?) AND ("cars"."status" LIKE '%Available%')  [["status", "Suggested"]]
---
  def index
    if isAdmin? || isSuperAdmin?
      @q_cars = Car.ransack(params[:q])
    elsif isCustomer?
      @q_cars = Car.where.not(status: "Suggested").ransack(params[:q])
    end
    @cars = @q_cars.result().paginate(page: params[:page])