app/controllers/reservations_controller.rb

SELECT  "reservations".* FROM "reservations" ORDER BY "reservations"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 1]]
---
  def index
    @q_reservations = Reservation.ransack(params[:q])
    if isAdmin? || isSuperAdmin?
      @reservations = @q_reservations.result().paginate(page: params[:page])
    else
      @reservations = @q_reservations.result().where(:user_id => session[:user_id]).paginate(page: params[:page]) || [] # return current user record or empty

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @reservation = Reservation.find(params[:id])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("checkOutTime", "expectedReturnTime", "user_id", "car_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Reserved"], ["updated_at", "2021-09-04 20:14:15.020742"], ["id", 1]]
UPDATE "users" SET "available" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["available", "f"], ["updated_at", "2021-09-04 20:14:15.031831"], ["id", 1]]
---
  def create
    car_id = reservation_params[:car_id]
    user_id = reservation_params[:user_id]
    if user_id==""
      flash[:danger] = "You should select a user."
      redirect_to new_reservation_path(:car_id => car_id)
      return
    end
    unless Car.find(car_id).status == "Available"
      flash[:danger] = "This car is not available."
      redirect_to cars_path
      return
    end
    user = User.find(user_id)
    if user.available
      @reservation = Reservation.new(reservation_params)
      if @reservation.save
        flash[:success] = 'Reservation was successfully created.'
        # UserMailer.welcome_email(user).deliver
        PickupCheckJob.set(wait_until: @reservation.checkOutTime + 30.minutes).perform_later(@reservation.id)
        redirect_to @reservation
        car = Car.find(@reservation.car_id)
        car.update_attribute(:status, "Reserved")
        user.update_attribute(:available, false)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reservations" SET "pickUpTime" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["pickUpTime", "2021-10-10 14:01:00.431889"], ["updated_at", "2021-10-10 14:01:00.433574"], ["id", 3]]
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "CheckedOut"], ["updated_at", "2021-10-10 14:01:00.474671"], ["id", 1]]
---
  def pickup
    @reservation = Reservation.find(params[:id])
    if @reservation.checkOutTime > Time.now
      flash[:error] = 'You need to wait to pick up the car!'
      redirect_to @reservation
    elsif @reservation.update_attribute(:pickUpTime, Time.now)
      flash[:success] = 'Car was successfully picked up. Have a good time!'
      @reservation.update_attribute(:reservationStatus, "Active")
      car = Car.find(@reservation.car_id)
      car.update_attribute(:status, "CheckedOut")

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "reservations" SET "returnTime" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["returnTime", "2021-10-10 14:01:03.286611"], ["updated_at", "2021-10-10 14:01:03.288653"], ["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Available"], ["updated_at", "2021-10-10 14:01:03.344761"], ["id", 1]]
SELECT  "waitinglists".* FROM "waitinglists" WHERE "waitinglists"."car_id" = ? AND "waitinglists"."status" = ? ORDER BY "waitinglists"."id" ASC LIMIT ?  [["car_id", 1], ["status", "Awaiting"], ["LIMIT", 1000]]
UPDATE "users" SET "notification" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["notification", "You can reserve a car now!"], ["updated_at", "2021-10-10 14:01:03.400695"], ["id", 1]]
---
  def returncar
    @reservation = Reservation.find(params[:id])
    if @reservation.update_attribute(:returnTime, Time.now)
      flash[:success] = 'Car was successfully returned. Thank you!'
      @reservation.update_attribute(:reservationStatus, "Complete")
      user = User.find(@reservation.user_id)
      car = Car.find(@reservation.car_id)
      car.update_attribute(:status, "Available")

      # send email notification if someone is waiting
      Waitinglist.where({car_id: car.id, status: "Awaiting"}).find_each do |wait|
        UserMailer.car_available(User.find(wait.user_id), Car.find(wait.car_id)).deliver
        wait.update_attribute(:status, "Complete")

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reservations" SET "reservationStatus" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["reservationStatus", "Cancel"], ["updated_at", "2021-09-04 20:53:56.562969"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "available" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["available", "t"], ["updated_at", "2021-09-04 20:53:56.594305"], ["id", 1]]
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Available"], ["updated_at", "2021-09-04 20:53:56.613804"], ["id", 1]]
SELECT  "waitinglists".* FROM "waitinglists" WHERE "waitinglists"."car_id" = ? AND "waitinglists"."status" = ? ORDER BY "waitinglists"."id" ASC LIMIT ?  [["car_id", 1], ["status", "Awaiting"], ["LIMIT", 1000]]
---
  def cancel
    @reservation = Reservation.find(params[:id])
    if ["Active", "Complete", "Cancel"].include? @reservation.reservationStatus
      flash[:danger] = "Reservation cannot be canceled!"
      redirect_to @reservation
      return
    end
    if @reservation.update_attribute(:reservationStatus, "Cancel")
      User.find(@reservation.user_id).update_attribute(:available, true)
      Car.find(@reservation.car_id).update_attribute(:status, "Available")

      # send email notification if someone is waiting
      car = Car.find(@reservation.car_id)
      Waitinglist.where({car_id: car.id, status: "Awaiting"}).find_each do |wait|