app/controllers/users_controller.rb

  def index
    # @users = User.search(params).paginate(page: params[:page])
    if isAdmin?
      @q_users = User.where.not(role: "SuperAdmin").ransack(params[:q])
    else
      @q_users = User.ransack(params[:q])
    end
    @users = @q_users.result().paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE ("users"."role" != ?) AND "users"."role" = 'Customer' LIMIT ? OFFSET ?  [["role", "SuperAdmin"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE ("users"."role" != ?) AND "users"."role" = 'Customer'  [["role", "SuperAdmin"]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)