app/views/cars/index.html.erb

SELECT distinct manufacturer FROM "cars"
---
      <%= f.label :manufacturer %>
      <%= f.collection_select :manufacturer_cont, Car.select("distinct manufacturer"), :manufacturer, :manufacturer, {:include_blank => "Please select car manufacturer"}, { :class => 'form-control' } %>